tangyangguang/Esp32Base/src/web/internal/WebAppConfig.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB && ESP32BASE_ENABLE_APP_CONFIG

#include "WebInternal.h"
#include "../../core/internal/Esp32BaseConfigInternal.h"

namespace esp32base_web {

bool validConfigName(const char* value) {
    if (!value) {
        return false;
    }
    const size_t len = strlen(value);
    return len >= 1 && len <= 15;
}

Esp32BaseAppConfig::FieldType publicFieldType(AppConfigStoredType type) {
    switch (type) {
        case APP_CFG_STRING: return Esp32BaseAppConfig::FIELD_STRING;
        case APP_CFG_INT: return Esp32BaseAppConfig::FIELD_INT;
        case APP_CFG_DECIMAL: return Esp32BaseAppConfig::FIELD_DECIMAL;
        case APP_CFG_BOOL: return Esp32BaseAppConfig::FIELD_BOOL;
        case APP_CFG_ENUM: return Esp32BaseAppConfig::FIELD_ENUM;
    }
    return Esp32BaseAppConfig::FIELD_STRING;
}

Esp32BaseAppConfig::FieldRef makeFieldRef(const AppConfigFieldSlot& field) {
    Esp32BaseAppConfig::FieldRef ref = {field.groupId, field.ns, field.key, field.label, publicFieldType(field.type), field.restartRequired};
    return ref;
}

bool groupExists(const char* groupId) {
    if (!groupId || !groupId[0]) {
        return false;
    }
    for (uint8_t i = 0; i < g_appConfigGroupCount; ++i) {
        if (strcmp(g_appConfigGroups[i].id, groupId) == 0) {
            return true;
        }
    }
    return false;
}

bool fieldExists(const char* ns, const char* key) {
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        if (strcmp(g_appConfigFields[i].ns, ns) == 0 && strcmp(g_appConfigFields[i].key, key) == 0) {
            return true;
        }
    }
    return false;
}

bool validOptionalHelp(const char* help) {
    return !help || strlen(help) <= Esp32BaseAppConfig::HELP_MAX_LENGTH;
}

bool validOptionalUnit(const char* unit) {
    return !unit || strlen(unit) <= Esp32BaseAppConfig::UNIT_MAX_LENGTH;
}

void appConfigLogRegisterFailed(const char* reason, const char* type, const char* groupId,
                                const char* ns, const char* key) {
    ESP32BASE_LOG_E("appcfg",
                    "register_failed reason=%s type=%s group=%s ns=%s key=%s groups=%u/%u fields=%u/%u",
                    reason ? reason : "unknown",
                    type ? type : "-",
                    groupId ? groupId : "-",
                    ns ? ns : "-",
                    key ? key : "-",
                    static_cast<unsigned>(g_appConfigGroupCount),
                    static_cast<unsigned>(ESP32BASE_APP_CONFIG_MAX_GROUPS),
                    static_cast<unsigned>(g_appConfigFieldCount),
                    static_cast<unsigned>(ESP32BASE_APP_CONFIG_MAX_FIELDS));
}

void appConfigLogHelpTooLong(const char* type, const char* ns, const char* key, size_t length) {
    ESP32BASE_LOG_E("appcfg",
                    "register_failed reason=help_too_long type=%s ns=%s key=%s length=%u max=%u",
                    type ? type : "-",
                    ns ? ns : "-",
                    key ? key : "-",
                    static_cast<unsigned>(length),
                    static_cast<unsigned>(Esp32BaseAppConfig::HELP_MAX_LENGTH));
}

const char* fieldCommonRegistrationError(const char* groupId, const char* ns,
                                         const char* key, const char* label) {
    if (g_appConfigFieldCount >= ESP32BASE_APP_CONFIG_MAX_FIELDS) {
        return "field_capacity";
    }
    if (!groupId || !groupId[0]) {
        return "missing_group";
    }
    if (!groupExists(groupId)) {
        return "unknown_group";
    }
    if (!ns || !ns[0]) {
        return "missing_namespace";
    }
    if (!validConfigName(ns)) {
        return "invalid_namespace";
    }
    if (strncmp(ns, "eb_", 3) == 0) {
        return "reserved_namespace";
    }
    if (!key || !key[0]) {
        return "missing_key";
    }
    if (!validConfigName(key)) {
        return "invalid_key";
    }
    if (!label || !label[0]) {
        return "missing_label";
    }
    if (strlen(label) > Esp32BaseAppConfig::LABEL_MAX_LENGTH) {
        return "label_too_long";
    }
    if (fieldExists(ns, key)) {
        return "duplicate_field";
    }
    return nullptr;
}

bool enumValueAllowed(const Esp32BaseAppConfig::EnumField& field, const char* value) {
    if (!value) {
        return false;
    }
    for (uint8_t i = 0; i < field.optionCount; ++i) {
        if (field.options[i].value && strcmp(field.options[i].value, value) == 0) {
            return true;
        }
    }
    return false;
}

bool validEnumOptions(const Esp32BaseAppConfig::EnumField& field) {
    if (!field.options || field.optionCount == 0) {
        return false;
    }
    for (uint8_t i = 0; i < field.optionCount; ++i) {
        const char* value = field.options[i].value;
        const char* label = field.options[i].label;
        if (!value || !value[0] || strlen(value) > Esp32BaseAppConfig::ENUM_VALUE_MAX_LENGTH ||
            !label || !label[0] || strlen(label) > Esp32BaseAppConfig::LABEL_MAX_LENGTH) {
            return false;
        }
        for (uint8_t j = static_cast<uint8_t>(i + 1); j < field.optionCount; ++j) {
            if (field.options[j].value && strcmp(value, field.options[j].value) == 0) {
                return false;
            }
        }
    }
    return enumValueAllowed(field, field.defaultValue);
}

bool stepMatches(int32_t value, int32_t minValue, int32_t step) {
    if (step <= 0) {
        return false;
    }
    const int64_t diff = static_cast<int64_t>(value) - static_cast<int64_t>(minValue);
    return diff >= 0 && (diff % step) == 0;
}

bool parseStrictInt32(const char* text, int32_t& out) {
    if (!text || !text[0]) {
        return false;
    }
    char* end = nullptr;
    errno = 0;
    const long value = strtol(text, &end, 10);
    if (errno != 0 || !end || *end != '\0' || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    out = static_cast<int32_t>(value);
    return true;
}

int32_t pow10Int(uint8_t scale) {
    int32_t factor = 1;
    for (uint8_t i = 0; i < scale; ++i) {
        factor *= 10;
    }
    return factor;
}

bool formatDecimalRaw(int32_t raw, uint8_t scale, char* out, size_t len) {
    if (!out || len == 0 || scale > Esp32BaseAppConfig::DECIMAL_SCALE_MAX) {
        return false;
    }
    if (scale == 0) {
        snprintf(out, len, "%ld", static_cast<long>(raw));
        return true;
    }
    const int32_t factor = pow10Int(scale);
    int64_t absValue = raw;
    const bool neg = absValue < 0;
    if (neg) {
        absValue = -absValue;
    }
    char fracFmt[8];
    snprintf(fracFmt, sizeof(fracFmt), "%%0%ulld", static_cast<unsigned>(scale));
    char fracBuf[12];
    snprintf(fracBuf, sizeof(fracBuf), fracFmt, static_cast<long long>(absValue % factor));
    snprintf(out, len, "%s%lld.%s", neg ? "-" : "", static_cast<long long>(absValue / factor), fracBuf);
    return true;
}

bool parseDecimalRaw(const char* text, uint8_t scale, int32_t& rawOut) {
    if (!text || !text[0] || scale > Esp32BaseAppConfig::DECIMAL_SCALE_MAX) {
        return false;
    }
    const char* p = text;
    bool neg = false;
    if (*p == '-' || *p == '+') {
        neg = *p == '-';
        ++p;
    }
    const int32_t factor = pow10Int(scale);
    const int64_t maxAbsRaw = neg ? (static_cast<int64_t>(INT32_MAX) + 1LL) : static_cast<int64_t>(INT32_MAX);
    int64_t whole = 0;
    bool hadDigit = false;
    while (*p >= '0' && *p <= '9') {
        hadDigit = true;
        const int digit = *p - '0';
        whole = whole * 10 + digit;
        if (whole > maxAbsRaw / factor) {
            return false;
        }
        ++p;
    }
    int64_t frac = 0;
    uint8_t fracDigits = 0;
    if (*p == '.') {
        ++p;
        while (*p >= '0' && *p <= '9') {
            if (fracDigits >= scale) {
                return false;
            }
            frac = frac * 10 + (*p - '0');
            ++fracDigits;
            ++p;
        }
    }
    if (!hadDigit || *p != '\0') {
        return false;
    }
    while (fracDigits < scale) {
        frac *= 10;
        ++fracDigits;
    }
    int64_t raw = whole * factor + frac;
    if (raw > maxAbsRaw) {
        return false;
    }
    if (neg) {
        raw = -raw;
    }
    if (raw < INT32_MIN || raw > INT32_MAX) {
        return false;
    }
    rawOut = static_cast<int32_t>(raw);
    return true;
}

