tangyangguang/Esp32Base/src/web/internal/WebAppConfig.cpp
void sendAppConfigPage(const char* errorMessage = nullptr) {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    g_pageHeadProgmem = WEB_APPCFG_STYLE;
    Esp32BaseWeb::sendHeader(g_appConfigTitle);
    sendAppConfigScript();
    sendChunk("<div class='appcfg'>");
    Esp32BaseWeb::sendPageTitle(g_appConfigTitle, "Application configuration values stored by Esp32Base.");
    sendAppConfigTopMessage();
    sendAppConfigPendingRestartNotice();
    if (errorMessage && errorMessage[0]) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "App Config was not saved", errorMessage);
    }
    if (g_appConfigGroupCount == 0 || g_appConfigFieldCount == 0) {
        sendChunk("<section class='panel actionpanel'><h2>No App Config fields</h2><p class='muted'>No application configuration values are registered by the app.</p></section>");
        sendChunk("</div>");
        Esp32BaseWeb::sendFooter();
        return;
    }
    char buf[32];
    sendChunk("<form method='post' action='/esp32base/app-config' onsubmit='return acConfirm(this)' oninput='acDirty(this)' onchange='acDirty(this)'><input type='hidden' name='rev' value='");
    snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(g_appConfigRevision));
    sendEscapedHtmlChunk(buf);
    sendChunk("'>");
    for (uint8_t g = 0; g < g_appConfigGroupCount; ++g) {
        sendChunk("<section class='panel'><h2>");
        sendEscapedHtmlChunk(g_appConfigGroups[g].title);
        sendChunk("</h2>");
        for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
            const AppConfigFieldSlot& field = g_appConfigFields[i];
            if (strcmp(field.groupId, g_appConfigGroups[g].id) != 0) {
                continue;
            }
            char value[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
            int32_t raw = 0;
            bool boolean = false;
            readAppConfigValue(field, value, sizeof(value), raw, boolean);
            char name[8];
            appConfigFieldName(i, name, sizeof(name));
            sendChunk("<div class='acfield'><label for='");
            sendEscapedHtmlChunk(name);
            sendChunk("'>");
            sendEscapedHtmlChunk(field.label);
            if (field.restartRequired) {
                sendChunk(" <span class='tag warn restart'>restart</span>");
            }
            sendChunk("</label>");
            if (field.type == APP_CFG_BOOL) {
                sendChunk("<label><input id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' type='checkbox' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' value='1' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(boolean ? "true" : "false");
                sendChunk("' data-initial-text='");
                sendEscapedHtmlChunk(boolean ? "Enabled" : "Disabled");
                sendChunk("'");
                if (boolean) {
                    sendChunk(" checked");
                }
                sendChunk("> Enabled</label>");
            } else if (field.type == APP_CFG_ENUM) {
                sendChunk("<select id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(value);
                sendChunk("' data-initial-text='");
                for (uint8_t o = 0; o < field.spec.enumField.optionCount; ++o) {
                    const Esp32BaseAppConfig::EnumOption& opt = field.spec.enumField.options[o];
                    if (strcmp(value, opt.value) == 0) {
                        sendEscapedHtmlChunk(opt.label);
                        break;
                    }
                }
                sendChunk("'>");
                for (uint8_t o = 0; o < field.spec.enumField.optionCount; ++o) {
                    const Esp32BaseAppConfig::EnumOption& opt = field.spec.enumField.options[o];
                    sendChunk("<option value='");
                    sendEscapedHtmlChunk(opt.value);
                    sendChunk("'");
                    if (strcmp(value, opt.value) == 0) {
                        sendChunk(" selected");
                    }
                    sendChunk(">");
                    sendEscapedHtmlChunk(opt.label);
                    sendChunk("</option>");
                }
                sendChunk("</select>");
            } else {
                sendChunk("<div class='acrow'><input id='");
                sendEscapedHtmlChunk(name);
                sendChunk("' name='");
                sendEscapedHtmlChunk(name);
                sendChunk("' data-ac='1' data-label='");
                sendEscapedHtmlChunk(field.label);
                sendChunk("' data-group='");
                sendEscapedHtmlChunk(g_appConfigGroups[g].title);
                sendChunk("' data-initial='");
                sendEscapedHtmlChunk(value);
                sendChunk("' value='");
                sendEscapedHtmlChunk(value);
                sendChunk("'");
                if (field.type == APP_CFG_STRING) {
                    snprintf(buf, sizeof(buf), "%u", field.spec.stringField.maxLength);
                    sendChunk(" maxlength='");
                    sendEscapedHtmlChunk(buf);
                    sendChunk("'");
                } else {
                    sendChunk(" type='number'");
                    if (field.type == APP_CFG_INT) {
                        sendChunk(" min='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.minValue));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("' max='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.maxValue));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("' step='");
                        snprintf(buf, sizeof(buf), "%ld", static_cast<long>(field.spec.intField.step));
                        sendEscapedHtmlChunk(buf);
                        sendChunk("'");
                    } else if (field.type == APP_CFG_DECIMAL) {
                        char num[32];
                        sendChunk(" min='");
                        formatDecimalRaw(field.spec.decimalField.minRawValue, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("' max='");
                        formatDecimalRaw(field.spec.decimalField.maxRawValue, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("' step='");
                        formatDecimalRaw(field.spec.decimalField.stepRaw, field.spec.decimalField.scale, num, sizeof(num));
                        sendEscapedHtmlChunk(num);
                        sendChunk("'");
                    }
                }
                sendChunk(">");
                if (field.unit && field.unit[0]) {
                    sendChunk("<span class='unit'>");
                    sendEscapedHtmlChunk(field.unit);
                    sendChunk("</span>");
                }
                sendChunk("</div>");
            }
            if (field.help && field.help[0]) {
                sendChunk("<p class='help'>");
                sendEscapedHtmlChunk(field.help);
                sendChunk("</p>");
            }
            sendChunk("</div>");
        }
        sendChunk("</section>");
    }
    sendChunk("<div id='acbox' class='confirmbox' aria-hidden='true'><h2>Confirm changes</h2><p class='reviewhint'>Review the changed values before saving.</p><div class='tablewrap'><table><thead><tr><th>Parameter</th><th>Old</th><th>New</th></tr></thead><tbody id='acrows'></tbody></table></div><div class='actions'><input type='button' value='Confirm Save' onclick='acSubmit(this.form)'> <input class='cancelbtn' type='button' value='Cancel' onclick='acCancel(this.form)'></div></div><div id='acsavebar' class='actions acsavebar'><input type='submit' value='Save App Config'></div></form></div>");
    Esp32BaseWeb::sendFooter();
}

bool validateAllSubmitted(char* error, size_t errorLen) {
    char submitted[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char normalized[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        const AppConfigFieldSlot& field = g_appConfigFields[i];
        if (!getSubmittedRaw(field, i, submitted, sizeof(submitted))) {
            snprintf(error, errorLen, "%s is missing.", field.label);
            return false;
        }
        int32_t raw = 0;
        bool boolean = false;
        if (!validateSubmittedField(field, submitted, normalized, sizeof(normalized), raw, boolean, error, errorLen)) {
            return false;
        }
    }
    if (g_appConfigPageValidate) {
        g_appConfigSubmitContext = true;
        const bool ok = g_appConfigPageValidate(error, errorLen);
        g_appConfigSubmitContext = false;
        if (!ok) {
            if (!error[0]) {
                strlcpy(error, "App Config is invalid.", errorLen);
            }
            return false;
        }
    }
    return true;
}

bool writeSubmittedField(const AppConfigFieldSlot& field, uint8_t index, Esp32BaseAppConfig::SaveSummary& summary) {
    char submitted[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char normalized[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char oldText[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char error[128] = "";
    int32_t newRaw = 0;
    int32_t oldRaw = 0;
    bool newBool = false;
    bool oldBool = false;
    getSubmittedRaw(field, index, submitted, sizeof(submitted));
    validateSubmittedField(field, submitted, normalized, sizeof(normalized), newRaw, newBool, error, sizeof(error));
    readAppConfigValue(field, oldText, sizeof(oldText), oldRaw, oldBool);
    bool changed = false;
    bool ok = true;
    switch (field.type) {
        case APP_CFG_STRING:
        case APP_CFG_ENUM:
            changed = strcmp(oldText, normalized) != 0;
            if (changed) {
                ok = Esp32BaseConfig::setStr(field.ns, field.key, normalized);
            }
            break;
        case APP_CFG_INT:
        case APP_CFG_DECIMAL:
            changed = oldRaw != newRaw;
            if (changed) {
                ok = Esp32BaseConfig::setInt(field.ns, field.key, newRaw);
            }
            break;
        case APP_CFG_BOOL:
            changed = oldBool != newBool;
            if (changed) {
                ok = Esp32BaseConfig::setBool(field.ns, field.key, newBool);
            }
            break;
    }
    if (!changed) {
        return true;
    }
    summary.changedCount++;
    if (!ok) {
        summary.failedCount++;
        return false;
    }
    summary.savedCount++;
    summary.restartRequired = summary.restartRequired || field.restartRequired;
    updateAppConfigPendingRestart(field, index, oldText, oldRaw, oldBool, normalized, newRaw, newBool);
    if (g_appConfigChangeCallback) {
        Esp32BaseAppConfig::Change change;
        change.field = makeFieldRef(field);
        change.oldValue = makeFieldValue(field, oldText, oldRaw, oldBool);
        change.newValue = makeFieldValue(field, normalized, newRaw, newBool);
        g_appConfigChangeCallback(change);
    }
    return true;
}

bool validateAppConfigDefaults(char* error, size_t errorLen) {
    g_appConfigDefaultContext = true;
    const bool ok = validateAllSubmitted(error, errorLen);
    g_appConfigDefaultContext = false;
    return ok;
}

bool restoreAppConfigField(const AppConfigFieldSlot& field, uint8_t index,
                           Esp32BaseAppConfig::SaveSummary& summary, uint8_t& clearedCount) {
    char candidate[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char normalized[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char oldText[Esp32BaseAppConfig::STRING_MAX_LENGTH + 1];
    char error[128] = "";
    int32_t newRaw = 0;
    int32_t oldRaw = 0;
    bool newBool = false;
    bool oldBool = false;
    if (!getAppConfigDefaultRaw(field, candidate, sizeof(candidate)) ||
        !validateSubmittedField(field, candidate, normalized, sizeof(normalized),
                                newRaw, newBool, error, sizeof(error))) {
        summary.failedCount++;
        ESP32BASE_LOG_W("appcfg", "defaults_restore_field_invalid ns=%s key=%s reason=%s",
                        field.ns, field.key, error[0] ? error : "invalid_default");
        return false;
    }
    readAppConfigValue(field, oldText, sizeof(oldText), oldRaw, oldBool);
    bool changed = false;
    switch (field.type) {
        case APP_CFG_STRING:
        case APP_CFG_ENUM:
            changed = strcmp(oldText, normalized) != 0;
            break;
        case APP_CFG_INT:
        case APP_CFG_DECIMAL:
            changed = oldRaw != newRaw;
            break;
        case APP_CFG_BOOL:
            changed = oldBool != newBool;
            break;
    }
    if (changed) {
        summary.changedCount++;
    }
    const esp32base_internal::ConfigKeyRemoveResult result =
        esp32base_internal::removeConfigKey(field.ns, field.key);
    if (result == esp32base_internal::ConfigKeyRemoveResult::Error) {
        summary.failedCount++;
        ESP32BASE_LOG_W("appcfg", "defaults_restore_remove_failed ns=%s key=%s", field.ns, field.key);
        return false;
    }
    if (result == esp32base_internal::ConfigKeyRemoveResult::Removed) {
        ++clearedCount;
    }
    if (!changed) {
        return true;
    }
    summary.savedCount++;
    summary.restartRequired = summary.restartRequired || field.restartRequired;
    updateAppConfigPendingRestart(field, index, oldText, oldRaw, oldBool, normalized, newRaw, newBool);
    if (g_appConfigChangeCallback) {
        Esp32BaseAppConfig::Change change;
        change.field = makeFieldRef(field);
        change.oldValue = makeFieldValue(field, oldText, oldRaw, oldBool);
        change.newValue = makeFieldValue(field, normalized, newRaw, newBool);
        g_appConfigChangeCallback(change);
    }
    return true;
}

void handleAppConfigSubmit() {
    markRequest();
    if (!ensurePostAllowed("app_config")) {
        return;
    }
    int32_t rev = 0;
    if (!g_server.hasArg("rev") || !parseStrictInt32(g_server.arg("rev").c_str(), rev) || static_cast<uint32_t>(rev) != g_appConfigRevision) {
        redirectSeeOther("/esp32base/app-config?stale=1");
        return;
    }
    char error[128] = "";
    if (!validateAllSubmitted(error, sizeof(error))) {
        sendAppConfigPage(error);
        return;
    }
    Esp32BaseAppConfig::SaveSummary summary = {};
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        if (!writeSubmittedField(g_appConfigFields[i], i, summary)) {
            break;
        }
    }
    if (summary.savedCount > 0) {
        g_appConfigRevision++;
    }
    if (g_appConfigSaveCallback) {
        g_appConfigSaveCallback(summary);
    }
    if (summary.failedCount > 0) {
        redirectSeeOther("/esp32base/app-config?partial=1");
    } else if (summary.restartRequired) {
        redirectSeeOther("/esp32base/app-config?restart=1");
    } else {
        redirectSeeOther(summary.savedCount > 0 ? "/esp32base/app-config?saved=1" : "/esp32base/app-config");
    }
}

void handleAppConfigPage() {
    sendAppConfigPage();
}

void handleToolsAppConfigDefaultsPost() {
    markRequest();
    if (!ensurePostAllowed("tools_app_config_defaults")) {
        return;
    }
    if (g_appConfigFieldCount == 0) {
        redirectSeeOther("/esp32base/system?error=app_config_defaults_unavailable");
        return;
    }
    char error[128] = "";
    if (!validateAppConfigDefaults(error, sizeof(error))) {
        ESP32BASE_LOG_W("appcfg", "defaults_restore_rejected source=tools reason=%s",
                        error[0] ? error : "app_validation");
        redirectSeeOther("/esp32base/system?app_config_defaults_rejected=1");
        return;
    }
    ESP32BASE_LOG_W("appcfg", "defaults_restore_requested source=tools fields=%u",
                    static_cast<unsigned>(g_appConfigFieldCount));
    Esp32BaseAppConfig::SaveSummary summary = {};
    uint8_t clearedCount = 0;
    for (uint8_t i = 0; i < g_appConfigFieldCount; ++i) {
        if (!restoreAppConfigField(g_appConfigFields[i], i, summary, clearedCount)) {
            break;
        }
    }
    if (clearedCount > 0) {
        ++g_appConfigRevision;
    }
    if (g_appConfigSaveCallback) {
        g_appConfigSaveCallback(summary);
    }
    ESP32BASE_LOG_W("appcfg",
                    "defaults_restore_completed source=tools cleared=%u changed=%u failed=%u restart=%s",
                    static_cast<unsigned>(clearedCount),
                    static_cast<unsigned>(summary.savedCount),
                    static_cast<unsigned>(summary.failedCount),
                    summary.restartRequired ? "yes" : "no");
    char target[160];
    if (summary.failedCount > 0) {
        snprintf(target, sizeof(target),
                 "/esp32base/system?app_config_defaults_partial=1&cleared=%u&changed=%u",
                 static_cast<unsigned>(clearedCount), static_cast<unsigned>(summary.savedCount));
    } else {
        snprintf(target, sizeof(target),
                 "/esp32base/system?app_config_defaults_restored=1&cleared=%u&changed=%u%s",
                 static_cast<unsigned>(clearedCount), static_cast<unsigned>(summary.savedCount),
                 summary.restartRequired ? "&restart=1" : "");
    }
    redirectSeeOther(target);
}

