tangyangguang/Esp32Base/src/web/internal/WebAppConfig.cpp
} // namespace esp32base_web

using namespace esp32base_web;

bool Esp32BaseAppConfig::setTitle(const char* title) {
    if (!title || !title[0] || strlen(title) >= sizeof(g_appConfigTitle)) {
        return false;
    }
    strlcpy(g_appConfigTitle, title, sizeof(g_appConfigTitle));
    return true;
}

bool Esp32BaseAppConfig::setPageValidateCallback(PageValidateCallback callback) {
    g_appConfigPageValidate = callback;
    return true;
}

bool Esp32BaseAppConfig::setChangeCallback(ChangeCallback callback) {
    g_appConfigChangeCallback = callback;
    return true;
}

bool Esp32BaseAppConfig::setSaveCallback(SaveCallback callback) {
    g_appConfigSaveCallback = callback;
    return true;
}

bool Esp32BaseAppConfig::addGroup(const Group& group) {
    const char* reason = nullptr;
    if (!group.id || !group.id[0]) reason = "missing_id";
    else if (strlen(group.id) > 15) reason = "id_too_long";
    else if (!group.title || !group.title[0]) reason = "missing_title";
    else if (strlen(group.title) > LABEL_MAX_LENGTH) reason = "title_too_long";
    else if (g_appConfigGroupCount >= ESP32BASE_APP_CONFIG_MAX_GROUPS) reason = "group_capacity";
    else if (groupExists(group.id)) reason = "duplicate_group";
    if (reason) {
        ESP32BASE_LOG_E("appcfg", "group_register_failed reason=%s id=%s groups=%u/%u",
                        reason,
                        group.id ? group.id : "-",
                        static_cast<unsigned>(g_appConfigGroupCount),
                        static_cast<unsigned>(ESP32BASE_APP_CONFIG_MAX_GROUPS));
        return false;
    }
    AppConfigGroupSlot& slot = g_appConfigGroups[g_appConfigGroupCount++];
    slot.used = true;
    slot.id = group.id;
    slot.title = group.title;
    return true;
}

bool Esp32BaseAppConfig::addString(const StringField& field) {
    if (!validOptionalHelp(field.help)) {
        appConfigLogHelpTooLong("string", field.ns, field.key, strlen(field.help));
        return false;
    }
    const char* reason = fieldCommonRegistrationError(field.groupId, field.ns, field.key, field.label);
    if (!reason && field.minLength > field.maxLength) reason = "invalid_length_range";
    if (!reason && field.maxLength > STRING_MAX_LENGTH) reason = "max_length_exceeded";
    if (!reason && !field.defaultValue) reason = "missing_default";
    if (!reason && (strlen(field.defaultValue) < field.minLength || strlen(field.defaultValue) > field.maxLength)) {
        reason = "default_length_out_of_range";
    }
    if (reason) {
        appConfigLogRegisterFailed(reason, "string", field.groupId, field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_STRING;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.stringField = field;
    return true;
}

bool Esp32BaseAppConfig::addInt(const IntField& field) {
    if (!validOptionalHelp(field.help)) {
        appConfigLogHelpTooLong("int", field.ns, field.key, strlen(field.help));
        return false;
    }
    const char* reason = fieldCommonRegistrationError(field.groupId, field.ns, field.key, field.label);
    if (!reason && !validOptionalUnit(field.unit)) reason = "unit_too_long";
    if (!reason && field.minValue > field.maxValue) reason = "invalid_range";
    if (!reason && (field.defaultValue < field.minValue || field.defaultValue > field.maxValue)) reason = "default_out_of_range";
    if (!reason && field.step <= 0) reason = "invalid_step";
    if (!reason && !stepMatches(field.defaultValue, field.minValue, field.step)) reason = "default_step_mismatch";
    if (reason) {
        appConfigLogRegisterFailed(reason, "int", field.groupId, field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_INT;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.unit = field.unit;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.intField = field;
    return true;
}

bool Esp32BaseAppConfig::addDecimal(const DecimalField& field) {
    if (!validOptionalHelp(field.help)) {
        appConfigLogHelpTooLong("decimal", field.ns, field.key, strlen(field.help));
        return false;
    }
    const char* reason = fieldCommonRegistrationError(field.groupId, field.ns, field.key, field.label);
    if (!reason && !validOptionalUnit(field.unit)) reason = "unit_too_long";
    if (!reason && field.scale > DECIMAL_SCALE_MAX) reason = "invalid_scale";
    if (!reason && field.minRawValue > field.maxRawValue) reason = "invalid_range";
    if (!reason && (field.defaultRawValue < field.minRawValue || field.defaultRawValue > field.maxRawValue)) reason = "default_out_of_range";
    if (!reason && field.stepRaw <= 0) reason = "invalid_step";
    if (!reason && !stepMatches(field.defaultRawValue, field.minRawValue, field.stepRaw)) reason = "default_step_mismatch";
    if (reason) {
        appConfigLogRegisterFailed(reason, "decimal", field.groupId, field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_DECIMAL;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.unit = field.unit;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.decimalField = field;
    return true;
}

bool Esp32BaseAppConfig::addBool(const BoolField& field) {
    if (!validOptionalHelp(field.help)) {
        appConfigLogHelpTooLong("bool", field.ns, field.key, strlen(field.help));
        return false;
    }
    const char* reason = fieldCommonRegistrationError(field.groupId, field.ns, field.key, field.label);
    if (reason) {
        appConfigLogRegisterFailed(reason, "bool", field.groupId, field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_BOOL;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.boolField = field;
    return true;
}

