tangyangguang/Esp32Base/src/web/internal/WebAppConfig.cpp
bool Esp32BaseAppConfig::addEnum(const EnumField& field) {
    if (!validOptionalHelp(field.help)) {
        appConfigLogHelpTooLong("enum", field.ns, field.key, strlen(field.help));
        return false;
    }
    const char* reason = fieldCommonRegistrationError(field.groupId, field.ns, field.key, field.label);
    if (!reason && !validEnumOptions(field)) reason = "invalid_enum_options";
    if (reason) {
        appConfigLogRegisterFailed(reason, "enum", field.groupId, field.ns, field.key);
        return false;
    }
    AppConfigFieldSlot& slot = g_appConfigFields[g_appConfigFieldCount++];
    memset(&slot, 0, sizeof(slot));
    slot.used = true;
    slot.type = APP_CFG_ENUM;
    slot.groupId = field.groupId;
    slot.ns = field.ns;
    slot.key = field.key;
    slot.label = field.label;
    slot.help = field.help;
    slot.restartRequired = field.restartRequired;
    slot.validate = field.validate;
    slot.spec.enumField = field;
    return true;
}

bool Esp32BaseAppConfig::submittedString(const char* ns, const char* key, char* out, size_t len) {
    const AppConfigFieldSlot* field = nullptr;
    return g_appConfigSubmitContext && findSubmittedRaw(ns, key, out, len, &field) && field && field->type == APP_CFG_STRING;
}

bool Esp32BaseAppConfig::submittedInt(const char* ns, const char* key, int32_t& out) {
    char raw[32];
    const AppConfigFieldSlot* field = nullptr;
    return g_appConfigSubmitContext && findSubmittedRaw(ns, key, raw, sizeof(raw), &field) && field && field->type == APP_CFG_INT && parseStrictInt32(raw, out);
}

bool Esp32BaseAppConfig::submittedDecimal(const char* ns, const char* key, int32_t& rawOut) {
    char raw[32];
    const AppConfigFieldSlot* field = nullptr;
    return g_appConfigSubmitContext && findSubmittedRaw(ns, key, raw, sizeof(raw), &field) && field && field->type == APP_CFG_DECIMAL &&
           parseDecimalRaw(raw, field->spec.decimalField.scale, rawOut);
}

bool Esp32BaseAppConfig::submittedBool(const char* ns, const char* key, bool& out) {
    char raw[4];
    const AppConfigFieldSlot* field = nullptr;
    if (!(g_appConfigSubmitContext && findSubmittedRaw(ns, key, raw, sizeof(raw), &field) && field && field->type == APP_CFG_BOOL)) {
        return false;
    }
    out = strcmp(raw, "1") == 0;
    return true;
}

bool Esp32BaseAppConfig::submittedEnum(const char* ns, const char* key, char* out, size_t len) {
    const AppConfigFieldSlot* field = nullptr;
    return g_appConfigSubmitContext && findSubmittedRaw(ns, key, out, len, &field) && field && field->type == APP_CFG_ENUM;
}

#endif
